         PCB    TYPE=DB,DBDNAME=IVPDB1,PROCOPT=A,KEYLEN=10,SB=COND,    X
               PCBNAME=TELEPCB1
         SENSEG NAME=A1111111,PARENT=0,PROCOPT=A
         PCB    TYPE=GSAM,DBDNAME=IVPDB5,PROCOPT=G
         PCB    TYPE=GSAM,DBDNAME=IVPDB5,PROCOPT=L
         PSBGEN LANG=PL/I,PSBNAME=FSPIVPPL,CMPAT=YES
         END