         PCB    TYPE=DB,DBDNAME=IVPDB1,PROCOPT=A,KEYLEN=10,SB=COND,    X
               PCBNAME=TELEPCB1
         SENSEG NAME=A1111111,PARENT=0,PROCOPT=A
IVD5I    PCB    TYPE=GSAM,DBDNAME=IVPDB5,PROCOPT=G
IVD5O    PCB    TYPE=GSAM,DBDNAME=IVPDB5,PROCOPT=L
         PSBGEN LANG=COBOL,PSBNAME=FSPIVP99,CMPAT=YES,OLIC=YES
         END